_site/2016-08-28-english-cucumber.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>单词本：蔬菜之黄瓜</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>单词本：蔬菜之黄瓜 </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>28 August 2016</span>
    </div>
    <div class="content">
      <div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> cucumber</h2>
<div class="outline-text-2" id="text-1">
<p>
黄瓜属不属于蔬菜还是值得商榷的，很多人把黄瓜当水果吃的。
</p>

<p>
水果必须是有水分而且有甜味的吗？好像也没有这么明确的定义。所以我们常常在意识中自己给自己设下了壁垒，随着年龄增长，慢慢变得成见在心，师心自用，顽固不化，分别我执。究其原因可能是思维的惰性吧。因为当我们在头脑中固化某些思维范式之后，就可以免得思考，直接使用了。好的方面是可以快速思考节省脑力，而坏的方面就会限制我们思考的创造性。
</p>

<p>
除了打破水果必须是甜的这个成见，另外我们可以打破另外一个成见：“蔬菜和水果的标签只能选其一”。那就是有些植物既是蔬菜也是水果。
</p>

<p>
所以，窃以为黄瓜既是蔬菜也是水果:-)
</p>

<p>
言归正传，黄瓜在英语里叫 cucumber 据说是来自法语 le concombre<sup>(fr)</sup>。德语就不太一样了，叫 die Gurke<sup>(de)</sup>，读起来好像“果壳”。果壳，Gurke 关联起来记忆还是挺容易的。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> gherkin</h2>
<div class="outline-text-2" id="text-2">
<p>
德语叫 Gurke<sup>(de)</sup> 可能和英语里另外一个单词 gherkin 同源吧。读音还是挺像的。
gherkin 指的是嫩嫩的小黄瓜，通常整个腌制了吃的。le cornichon<sup>(fr)</sup>，die
Salzgurke<sup>(de)</sup>。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> the Gherkin</h2>
<div class="outline-text-2" id="text-3">
<p>
据说伦敦的 Swiss Re Tower，又叫 the Gherkin：
</p>

<blockquote>
<p>
The Gherkin is London’s most instantly recognisable tower. Totalling 500,000 sq
ft, The Gherkin is an iconic structure housing a flourishing community.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> cucumber.io</h2>
<div class="outline-text-2" id="text-4">
<p>
顺便提一下有一个开源的行为驱动开发框架叫 Cucumber（<a href="https://cucumber.io/">https://cucumber.io/</a> ），而编写 Cucumber 框架下的测试用例使用的编程语言就叫 Gherkin。
</p>

<blockquote>
<p>
Gherkin is the language that Cucumber understands. It is a Business Readable,
Domain Specific Language that lets you describe software’s behaviour without
detailing how that behaviour is implemented.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> pickled cucumber</h2>
<div class="outline-text-2" id="text-5">
<p>
腌黄瓜，酸黄瓜。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> sea cucumber</h2>
<div class="outline-text-2" id="text-6">
<p>
海黄瓜？不是的，其实是指海参。也许是因为作为棘皮动物（echinoderms）的海参长在海底皮肤像黄瓜。
</p>

<p>
法语也叫海黄瓜：le concombre de mer<sup>(fr)</sup>。
</p>

<p>
海参也叫 trepang，teripang：
</p>

<ul class="org-ul">
<li>The island all around is rich in marine products and so on <i>trepang</i>, sea
scallop, abalone, shrimp, oyster, long standing reputation. 海岛周围海产丰富。比如海参、扇贝、鲍鱼、对虾、牡蛎等海产，久负盛名。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> cucumiform</h2>
<div class="outline-text-2" id="text-7">
<p>
黄瓜状的，黄瓜形的。
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> 淡定的黄瓜</h2>
<div class="outline-text-2" id="text-8">
<p>
英语里有句成语 to be as cool as a cucumber 像黄瓜一样淡定：
</p>

<ul class="org-ul">
<li>he leaps up the six flights of stairs and arrives at the top as cool as a
cucumber. 他窜上 6 层楼梯，爬到楼顶的时候像一根黄瓜一样气定神闲。</li>
<li>she looked as efficient as a hospital matron, as cool as a cucumber. 她看起来像医院护士长一样高效率，像黄瓜一样冷静。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> Summary</h2>
<div class="outline-text-2" id="text-9">
<p>
今天的主题是黄瓜，黄瓜又分大黄瓜（cucumber）和小黄瓜（gherkin）。不过德语不分大小黄瓜都叫 die Gurke<sup>(fr)</sup>。此外，淡定、冷静、气定神闲、从容不迫可以用黄瓜来形容：
to be as cool as a cucumber。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.thegherkinlondon.com/">http://www.thegherkinlondon.com/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/cucumber/cucumber/wiki/Gherkin">https://github.com/cucumber/cucumber/wiki/Gherkin</a>
</p></div></div>


</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#language-ref">
    		language <span>65</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#English-ref">English <span>46</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2016-08-26-english-chilli" title="单词本：蔬菜之红辣椒">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2016-08-29-english-courgette" title="单词本：蔬菜之西葫芦">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

